# 資料選擇
## 欄選擇
### 選擇某一欄/某幾欄

In [1]:
import pandas as pd
df = pd.read_excel(r"C:\ACD019600\data\test6.xlsx")
df

  訂單編號 客戶姓名  唯一識別碼       成交時間
0   A1   張通    101 2018-08-08
1   A2   李谷    102 2018-08-09
2   A3   孫鳳    103 2018-08-10
3   A4   趙桓    104 2018-08-11
4   A5   趙桓    104 2018-08-12

In [2]:
df["訂單編號"]

0    A1
1    A2
2    A3
3    A4
4    A5
Name: 訂單編號, dtype: object

In [3]:
df[["訂單編號","客戶姓名"]]

  訂單編號 客戶姓名
0   A1   張通
1   A2   李谷
2   A3   孫鳳
3   A4   趙桓
4   A5   趙桓

In [4]:
#取得第1欄和第3欄的數值
df

  訂單編號 客戶姓名  唯一識別碼       成交時間
0   A1   張通    101 2018-08-08
1   A2   李谷    102 2018-08-09
2   A3   孫鳳    103 2018-08-10
3   A4   趙桓    104 2018-08-11
4   A5   趙桓    104 2018-08-12

In [5]:
df.iloc[:,[0,2]] #取得第1欄和第3欄的數值

  訂單編號  唯一識別碼
0   A1    101
1   A2    102
2   A3    103
3   A4    104
4   A5    104

### 選擇連續的某幾欄

In [6]:
#取得第1欄到第4欄的資料
df.iloc[:,0:3]#取得第1欄到第4欄的值

  訂單編號 客戶姓名  唯一識別碼
0   A1   張通    101
1   A2   李谷    102
2   A3   孫鳳    103
3   A4   趙桓    104
4   A5   趙桓    104

## 列選擇
### 選擇某一列/某幾列

In [18]:
df=pd.read_excel("C:/ACD019600/data/test6.xlsx", sheet_name="6-2")
df.index=(["一","二","三","四"])
df

  訂單編號 客戶姓名  唯一識別碼       成交時間
一   A1   張通    101 2018-08-08
二   A2   李谷    102 2018-08-09
三   A3   孫鳳    103 2018-08-10
四   A4   趙桓    104 2018-08-11

In [23]:
df.loc["一"] #選擇一列

訂單編號                      A1
客戶姓名                      張通
唯一識別碼                    101
成交時間     2018-08-08 00:00:00
Name: 一, dtype: object

In [22]:
df.loc[["一","二"]] #選擇第一列和第二列

  訂單編號 客戶姓名  唯一識別碼       成交時間
一   A1   張通    101 2018-08-08
二   A2   李谷    102 2018-08-09

In [ ]:
#利用iloc方法
df

In [24]:
df.iloc[0]#選擇第一列

訂單編號                      A1
客戶姓名                      張通
唯一識別碼                    101
成交時間     2018-08-08 00:00:00
Name: 一, dtype: object

In [25]:
df.iloc[[0,1]]#選擇第一列和第二列

  訂單編號 客戶姓名  唯一識別碼       成交時間
一   A1   張通    101 2018-08-08
二   A2   李谷    102 2018-08-09

### 選擇連續的某幾列

In [26]:
df

  訂單編號 客戶姓名  唯一識別碼       成交時間
一   A1   張通    101 2018-08-08
二   A2   李谷    102 2018-08-09
三   A3   孫鳳    103 2018-08-10
四   A4   趙桓    104 2018-08-11

In [27]:
df.iloc[0:3]#選擇第一列到第三列

  訂單編號 客戶姓名  唯一識別碼       成交時間
一   A1   張通    101 2018-08-08
二   A2   李谷    102 2018-08-09
三   A3   孫鳳    103 2018-08-10

### 選擇滿足條件的列

In [29]:
df = pd.read_excel("C:/ACD019600/data/test6.xlsx",sheet_name = "6.2.3")
df

  訂單編號 客戶姓名  唯一識別碼   年齡       成交時間
0   A1   張通    101   31 2018-08-08
1   A2   李谷    102   45 2018-08-09
2   A3   孫鳳    103   23 2018-08-10
3   A4   趙桓    104  240 2018-08-11

In [30]:
df[df["年齡"]<200] #選擇年齡小於200的資料

  訂單編號 客戶姓名  唯一識別碼  年齡       成交時間
0   A1   張通    101  31 2018-08-08
1   A2   李谷    102  45 2018-08-09
2   A3   孫鳳    103  23 2018-08-10

In [31]:
df[(df["年齡"]<200) & (df["唯一識別碼"]<102)]

  訂單編號 客戶姓名  唯一識別碼  年齡       成交時間
0   A1   張通    101  31 2018-08-08

## 列欄同時選擇

### 普通索引+普通索引選擇指定的列和欄

In [44]:
#取得第一列、第三列和第一欄、第三欄資料
df = pd.read_excel(r"C:\ACD019600\data\test6.xlsx", sheet_name="6-3")
df.index=("一","二","三","四")
df

  訂單編號 客戶姓名  唯一識別碼   年齡       成交時間
一   A1   張通    101   31 2018-08-08
二   A2   李谷    102   45 2018-08-09
三   A3   孫鳳    103   23 2018-08-10
四   A4   趙桓    104  240 2018-08-11

In [45]:
#用loc方法傳入列欄名稱
df.loc[["一","三"],["訂單編號","唯一識別碼"]]

  訂單編號  唯一識別碼
一   A1    101
三   A3    103

### 位置索引+位置索引選擇指定的列和欄

In [46]:
#取得第一列、第二列和第一欄、第三欄資料
df

  訂單編號 客戶姓名  唯一識別碼   年齡       成交時間
一   A1   張通    101   31 2018-08-08
二   A2   李谷    102   45 2018-08-09
三   A3   孫鳳    103   23 2018-08-10
四   A4   趙桓    104  240 2018-08-11

In [47]:
df.iloc[[0,1],[0,2]]

  訂單編號  唯一識別碼
一   A1    101
二   A2    102

### 布林索引+普通索引選擇指定的列和欄

In [49]:
df

  訂單編號 客戶姓名  唯一識別碼   年齡       成交時間
一   A1   張通    101   31 2018-08-08
二   A2   李谷    102   45 2018-08-09
三   A3   孫鳳    103   23 2018-08-10
四   A4   趙桓    104  240 2018-08-11

In [48]:
df[df["年齡"]<200][["訂單編號","年齡"]]

  訂單編號  年齡
一   A1  31
二   A2  45
三   A3  23

### 切片索引+切片索引選擇指定的列和欄

In [50]:
#選擇第一到第三列，第二列欄第三欄
df

  訂單編號 客戶姓名  唯一識別碼   年齡       成交時間
一   A1   張通    101   31 2018-08-08
二   A2   李谷    102   45 2018-08-09
三   A3   孫鳳    103   23 2018-08-10
四   A4   趙桓    104  240 2018-08-11

In [51]:
df.iloc[0:3,1:3]

  客戶姓名  唯一識別碼
一   張通    101
二   李谷    102
三   孫鳳    103